WingTangWong/Wireless_esp8266_cc110_tool/src/remote/remote_main.cpp
/*
  remote_main.cpp - Wi-Fi remote control + display for the CC1101 318 MHz tool.

  Target: a second WeMOS/LOLIN D1 Mini (NO CC1101).
    OLED   SSD1306 128x64 I2C   SDA -> D2 / GPIO4,  SCL -> D1 / GPIO5,  addr 0x3C
    BTN_A  inner gate           D5 / GPIO14  -> GND, INPUT_PULLUP (active low)
    BTN_B  outer gate           D6 / GPIO12  -> GND, INPUT_PULLUP (active low)
    LED    status               D4 / GPIO2 (onboard, active low)

  It joins the main unit's SoftAP (cc1101-setup-<chipId>) using the shared
  ap_pass from secrets.ini - so the two are paired by default - polls the main
  unit's HTTP API for status, and POSTs /api/gate/fire when a button is pressed.

  OLED:
    - no Wi-Fi link / no reply from the node -> big "OFFLINE"
    - linked -> node idle / SENDING / BUSY state, and for each button whether a
      sample is assigned and READY.

  Onboard LED (also the indicator when headless): a 2 s "heartbeat" breathe -
  400 ms off, ~650 ms ease-in ramp up, 300 ms at peak, ~650 ms ramp down.
    - online / in range       -> peak 255
    - offline / out of range  -> peak 32 (dim)
    - button A pressed         -> fast single-pulse loop  (~2.5 s)
    - button B pressed         -> fast double-pulse + long gap  (~2.5 s)

  A tiny HTTP server on the remote exposes /api/remote/status and
  POST /api/remote/press?which=inner|outer for the build healthcheck.

  Build:  pio run -e d1_mini_remote [-t upload]
          -e d1_mini_remote_headless    display-less (serial + LED only)
          -e d1_mini_remote_selftest    headless + verbose serial + a loop that
                                        drives the node and checks state changes

  This file is the whole remote firmware; src/main.cpp / src/decode.* (the main
  unit) are excluded from this env via build_src_filter.
*/
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>

#ifndef REMOTE_HEADLESS
#include <SSD1306Wire.h>
#endif

// -----------------------------------------------------------------------------
// Compile-time config (from platformio.ini / secrets.ini)
// -----------------------------------------------------------------------------
#ifndef CFG_FW_VERSION
#define CFG_FW_VERSION "0.1.0-nogit"
#endif
#ifndef CFG_WIFI_AP_SSID
#define CFG_WIFI_AP_SSID "cc1101-setup"
#endif
#ifndef CFG_WIFI_AP_PASS
#define CFG_WIFI_AP_PASS "CHANGE_ME_AP_PASSWORD"
#endif
#ifndef CFG_REMOTE_TARGET_SSID
#define CFG_REMOTE_TARGET_SSID ""          // exact SSID to pin; "" = scan by prefix
#endif
#ifndef CFG_REMOTE_MAIN_IP
#define CFG_REMOTE_MAIN_IP "192.168.4.1"   // main unit's SoftAP address
#endif

static constexpr char FIRMWARE_VERSION[] = CFG_FW_VERSION;
static constexpr char AP_SSID_BASE[]     = CFG_WIFI_AP_SSID;
static constexpr char AP_PASS[]          = CFG_WIFI_AP_PASS;
static constexpr char TARGET_SSID_PIN[]  = CFG_REMOTE_TARGET_SSID;
static constexpr char MAIN_IP[]          = CFG_REMOTE_MAIN_IP;
static constexpr char HOSTNAME[]         = "cc1101-remote";

// -----------------------------------------------------------------------------
// Pins
// -----------------------------------------------------------------------------
static constexpr uint8_t PIN_LED   = LED_BUILTIN;  // D4 / GPIO2, active low
static constexpr uint8_t PIN_BTN_A = D5;           // GPIO14 - inner
static constexpr uint8_t PIN_BTN_B = D6;           // GPIO12 - outer

// -----------------------------------------------------------------------------
// Status LED (D4/GPIO2, active-low PWM). This is the primary indicator on a
// headless remote:
//   online / in range       -> "heartbeat" breathe, peak 255
//   offline / out of range  -> same heartbeat, dim (peak 32)
//   button A pressed         -> fast single-pulse loop  (~2.5 s)
//   button B pressed         -> fast double-pulse with a long gap  (~2.5 s)
// -----------------------------------------------------------------------------
enum LedMode { LED_OFFLINE, LED_ONLINE, LED_BTN_A, LED_BTN_B };
static LedMode  ledMode = LED_OFFLINE;
static uint32_t ledOverrideUntil = 0;

static void ledButton(char which) {
  ledMode = (which == 'A') ? LED_BTN_A : LED_BTN_B;
  ledOverrideUntil = millis() + 2500;
}

// b: 0 (fully off) .. 255 (fully on). LED is active-low; 0 and 255 are driven
// straight so "0" is really dark (PWM idle still leaks a little light).
static inline void ledLevel(int b) {
  b = constrain(b, 0, 255);
  if(b == 0)        digitalWrite(PIN_LED, HIGH);            // off
  else if(b >= 255) digitalWrite(PIN_LED, LOW);             // full
  else              analogWrite(PIN_LED, (255 - b) * 4);    // active-low PWM (range 1023)
}

// x, out: 0..1000. Ease-in curve (grows very slowly at first).
static inline uint32_t easeIn(uint32_t x) {
  return x * x / 1000 * x / 1000;   // cubic
}

// Heartbeat over a 2000 ms window: 20% off, 65% eased ramp up+down, 15% at peak.
//   0-400    off
//   400-1050 ramp 0 -> peak   (eased)
//   1050-1350 hold at peak
//   1350-2000 ramp peak -> 0  (mirror)
static uint32_t heartbeat(uint32_t phase, uint32_t peak) {
  if(phase < 400)  return 0;
  if(phase < 1050) return easeIn((phase - 400) * 1000 / 650) * peak / 1000;
  if(phase < 1350) return peak;
  if(phase < 2000) return easeIn((2000 - phase) * 1000 / 650) * peak / 1000;
  return 0;
}

static void updateLed(bool online) {
  const uint32_t t = millis();
  if((ledMode == LED_BTN_A || ledMode == LED_BTN_B) && t < ledOverrideUntil) {
    // fast pulse patterns
    if(ledMode == LED_BTN_A) {                       // single pulse, 200 ms
      uint32_t p = t % 200;
      ledLevel(p < 100 ? p * 255 / 100 : (200 - p) * 255 / 100);
    } else {                                         // double pulse then gap, 900 ms
      uint32_t p = t % 900;
      bool on = (p < 90) || (p >= 200 && p < 290);
      ledLevel(on ? 255 : 0);
    }
    return;
  }
  ledMode = online ? LED_ONLINE : LED_OFFLINE;
  ledLevel((int)heartbeat(t % 2000, ledMode == LED_ONLINE ? 255 : 32));
}

