WingTangWong/Wireless_esp8266_cc110_tool/src/remote/remote_main.cpp
// -----------------------------------------------------------------------------
// Timing
// -----------------------------------------------------------------------------
static constexpr uint32_t POLL_INTERVAL_MS   = 1500;
static constexpr uint32_t RECONNECT_EVERY_MS = 8000;
static constexpr uint32_t BTN_DEBOUNCE_MS    = 30;
static constexpr uint32_t TOAST_MS           = 2500;
static constexpr uint32_t HTTP_TIMEOUT_MS    = 4000;

// -----------------------------------------------------------------------------
// State
// -----------------------------------------------------------------------------
ESP8266WebServer server(80);

#ifndef REMOTE_HEADLESS
SSD1306Wire display(0x3c, D2, D1);   // SDA=D2/GPIO4, SCL=D1/GPIO5
#endif

String  joinedSsid;
bool    linkUp = false;
uint32_t lastPollMs = 0;
uint32_t lastReconnectMs = 0;
uint32_t bootMs = 0;

// Cached view of the main unit
struct MainView {
  bool    valid = false;
  uint32_t fetchedMs = 0;
  bool    ok = false;
  bool    radio = false;
  bool    busy = false;
  String  mode = "?";
  long    frequencyHz = 0;
  long    heap = 0;
  int     wifiRssi = 0;
  String  fwVersion = "?";
  // gate
  bool    gateEnabled = false;
  String  innerSample, outerSample;
  bool    innerReady = false, outerReady = false;
  String  lastFireError;
} mainView;

// Transient on-screen message
String   toast;
uint32_t toastUntilMs = 0;

static void setToast(const String& s) {
  toast = s;
  toastUntilMs = millis() + TOAST_MS;
}

// -----------------------------------------------------------------------------
// Tiny JSON value extraction (no allocations beyond the returned String)
// Handles `"key":"str"`, `"key":123`, `"key":true/false/null`.
// -----------------------------------------------------------------------------
static bool jsonRaw(const String& body, const char* key, String& out) {
  String needle = String("\"") + key + "\":";
  int k = body.indexOf(needle);
  if(k < 0) return false;
  int i = k + needle.length();
  while(i < (int)body.length() && (body[i] == ' ' || body[i] == '\t')) ++i;
  if(i >= (int)body.length()) return false;

  if(body[i] == '"') {
    int end = i + 1;
    while(end < (int)body.length() && body[end] != '"') {
      if(body[end] == '\\') ++end;
      ++end;
    }
    out = body.substring(i + 1, end);
    return true;
  }
  if(body[i] == '{' || body[i] == '[') {
    char open = body[i], close = (open == '{') ? '}' : ']';
    int depth = 0, end = i;
    for(; end < (int)body.length(); ++end) {
      if(body[end] == open) ++depth;
      else if(body[end] == close && --depth == 0) { ++end; break; }
    }
    out = body.substring(i, end);
    return true;
  }
  int end = i;
  while(end < (int)body.length() && body[end] != ',' && body[end] != '}' && body[end] != ']') ++end;
  out = body.substring(i, end);
  out.trim();
  return true;
}

static long jsonInt(const String& body, const char* key, long def = 0) {
  String v;
  return jsonRaw(body, key, v) ? v.toInt() : def;
}
static bool jsonBool(const String& body, const char* key, bool def = false) {
  String v;
  if(!jsonRaw(body, key, v)) return def;
  return v == "true" || v == "1";
}
static String jsonStr(const String& body, const char* key) {
  String v;
  jsonRaw(body, key, v);
  return v;
}

// -----------------------------------------------------------------------------
// HTTP to the main unit
// -----------------------------------------------------------------------------
static bool mainRequest(const char* method, const String& path, String& bodyOut, int* codeOut = nullptr) {
  if(codeOut) *codeOut = 0;
  if(WiFi.status() != WL_CONNECTED) return false;
  WiFiClient client;
  HTTPClient http;
  http.setTimeout(HTTP_TIMEOUT_MS);
  String url = String("http://") + MAIN_IP + path;
  if(!http.begin(client, url)) return false;

  int code = (strcmp(method, "POST") == 0) ? http.POST("") : http.GET();
  if(codeOut) *codeOut = code;
  bool got = code > 0;
  if(got) bodyOut = http.getString();
  http.end();
#ifdef REMOTE_SELFTEST
  Serial.printf("  %s %s -> %d%s\n", method, path.c_str(), code,
                got ? (String("  ") + bodyOut).c_str() : "  (no response)");
#endif
  return got && code >= 200 && code < 300;
}

static void refreshMainView() {
  String body;
  MainView v;
  v.fetchedMs = millis();

  if(!mainRequest("GET", "/api/status", body)) {
    mainView.valid = mainView.valid;  // keep previous; mark stale via age
    mainView.fetchedMs = 0;
    return;
  }
  v.valid = true;
  v.ok = jsonBool(body, "ok");
  v.radio = jsonBool(body, "radio");
  v.busy = jsonBool(body, "busy");
  v.mode = jsonStr(body, "mode");
  v.frequencyHz = jsonInt(body, "frequencyHz");
  v.heap = jsonInt(body, "heap");
  v.wifiRssi = (int)jsonInt(body, "wifiRssi");
  v.fwVersion = jsonStr(body, "firmwareVersion");

  if(mainRequest("GET", "/api/gate", body)) {
    v.gateEnabled = jsonBool(body, "enabled");
    v.lastFireError = jsonStr(body, "lastFireError");
    String inner, outer;
    jsonRaw(body, "inner", inner);
    jsonRaw(body, "outer", outer);
    v.innerSample = jsonStr(inner, "sampleName");
    v.outerSample = jsonStr(outer, "sampleName");
    v.innerReady = jsonBool(inner, "ready");
    v.outerReady = jsonBool(outer, "ready");
  }

  mainView = v;
}

// which = "inner" | "outer"; returns the main unit's response text (or an error).
// *okOut = the fire was accepted; *codeOut = HTTP status (0 = no response).
static String fireGateOnMain(const char* which, bool* okOut, int* codeOut = nullptr) {
  String body;
  int code = 0;
  bool ok = mainRequest("POST", String("/api/gate/fire?which=") + which, body, &code);
  if(okOut) *okOut = ok && jsonBool(body, "ok");
  if(codeOut) *codeOut = code;
  if(code == 0 && body.length() == 0) body = "{\"ok\":false,\"error\":\"no response from main unit\"}";
  return body;
}

// -----------------------------------------------------------------------------
// Self-test (build with -DREMOTE_SELFTEST / env d1_mini_remote_selftest):
// pull every config/status endpoint over Wi-Fi and dump it to serial, then
// drive a command and both "button" commands and confirm the main unit's
// state actually changed. Runs on a timer so it can be watched on the monitor.
// -----------------------------------------------------------------------------
#ifdef REMOTE_SELFTEST
static void stSnapshot() {
  String b;
  Serial.println(F("\n========== MAIN UNIT SNAPSHOT =========="));
  for(const char* p : {"/api/status", "/api/gate", "/api/selftest", "/api/config", "/api/samples"}) {
    if(mainRequest("GET", p, b)) Serial.printf("%-16s %s\n", p, b.c_str());
    else                         Serial.printf("%-16s (no 2xx)\n", p);
    yield();
  }
}

// Waits (up to `ms`) for the main unit to report busy=false.
static void stWaitIdle(uint32_t ms) {
  uint32_t end = millis() + ms;
  String b;
  while(millis() < end) {
    if(mainRequest("GET", "/api/status", b) && !jsonBool(b, "busy")) return;
    delay(200);
    yield();
  }
}

// -DREMOTE_SELFTEST_FIRE additionally lets the self-test fire an assigned+ready
// gate (which actuates real hardware). Off by default.
static void stRun() {
  Serial.println(F("\n========== REMOTE SELF-TEST =========="));
  String b;
  int pass = 0, skip = 0, total = 0;

  // --- 1. remote command -> node state change: retune (no TX) --------------
  ++total;
  mainRequest("GET", "/api/status", b);
  long f0 = jsonInt(b, "frequencyHz", 318000000);
  long bw0 = jsonInt(b, "bandwidthKhz", 650);
  long f1 = (f0 + 40000 <= 348000000) ? f0 + 40000 : f0 - 40000;
  Serial.printf("[1] retune  %ld -> %ld Hz\n", f0, f1);
  bool tuned = mainRequest("GET", String("/api/tune?hz=") + f1 + "&bw=" + bw0, b);
  delay(150);
  mainRequest("GET", "/api/status", b);
  long fNow = jsonInt(b, "frequencyHz");
  bool p1 = tuned && (fNow == f1);
  Serial.printf("    node frequencyHz now %ld   %s\n", fNow, p1 ? "PASS" : "FAIL");
  mainRequest("GET", String("/api/tune?hz=") + f0 + "&bw=" + bw0, b);   // restore
  if(p1) ++pass;

  // --- 2. remote command -> node activity: a short capture (RX only) -------
  ++total;
  Serial.println(F("[2] GET /api/capture/start?ms=1200  (poll for 'recording')"));
  bool started = mainRequest("GET", "/api/capture/start?ms=1200", b);
  bool p2 = false;
  String mode;
  for(int i = 0; i < 10 && !p2; ++i) {
    if(mainRequest("GET", "/api/status", b)) {
      mode = jsonStr(b, "mode");
      if(started && (mode == "recording" || jsonBool(b, "busy"))) p2 = true;
    }
    if(!p2) delay(120);
  }
  Serial.printf("    node reached mode='%s'   %s\n", p2 ? "recording" : mode.c_str(), p2 ? "PASS" : "FAIL");
  stWaitIdle(4000);
  if(p2) ++pass;

  // --- 3+4. simulate each button; confirm the press reached the node ------
  for(const char* which : {"inner", "outer"}) {
    ++total;
    mainRequest("GET", "/api/gate", b);
    String whichObj;
    jsonRaw(b, which, whichObj);
    bool ready = jsonBool(whichObj, "ready");
    bool assigned = jsonStr(whichObj, "sampleName").length() > 0;
    String errBefore = jsonStr(b, "lastFireError");
    Serial.printf("[%d] simulate BTN %s  (assigned=%d ready=%d)\n", total, which, assigned, ready);

    int  fireCode = 0;
    bool fireOk = false;
#ifndef REMOTE_SELFTEST_FIRE
    if(ready) {
      Serial.println(F("    gate is live -> SKIP (build with -DREMOTE_SELFTEST_FIRE, or"));
      Serial.println(F("    press the button / POST /api/remote/press to test the live fire)"));
      ++skip;
      continue;
    }
#endif
    ledButton(strcmp(which, "inner") == 0 ? 'A' : 'B');
    String resp = fireGateOnMain(which, &fireOk, &fireCode);
    Serial.printf("    fire resp: %s\n", resp.c_str());
    delay(250);
    mainRequest("GET", "/api/gate", b);
    String errAfter = jsonStr(b, "lastFireError");
    mainRequest("GET", "/api/status", b);
    String modeAfter = jsonStr(b, "mode");
    Serial.printf("    lastFireError '%s' -> '%s'   node mode '%s'\n",
                  errBefore.c_str(), errAfter.c_str(), modeAfter.c_str());

    // PASS = the press reached the node (real HTTP reply) AND, if it fired,
    // the node reacted (mode/playback or a new lastFireError).
    bool reached = fireCode > 0;
    bool reacted = fireOk || modeAfter == "playback" || jsonBool(b, "busy") ||
                   (errAfter.length() && errAfter != errBefore) ||
                   (!ready && fireCode >= 400);   // unassigned -> expected reject
    bool p = reached && reacted;
    Serial.printf("    press->node: reached=%d reacted=%d  %s (HTTP %d)\n",
                  reached, reacted, p ? "PASS" : "FAIL", fireCode);
    if(p) ++pass;
    stWaitIdle(4000);
  }

  Serial.printf("========== SELF-TEST  %d PASS / %d SKIP / %d total  -> %s ==========\n\n",
                pass, skip, total, (pass + skip == total) ? "OK" : "FAIL");
}
#endif  // REMOTE_SELFTEST

