WingTangWong/Wireless_esp8266_cc110_tool/src/remote/remote_main.cpp
// -----------------------------------------------------------------------------
// Wi-Fi pairing: join the main unit's SoftAP
// -----------------------------------------------------------------------------
static String pickTargetSsid() {
  if(TARGET_SSID_PIN[0] != '\0') return String(TARGET_SSID_PIN);

  int n = WiFi.scanNetworks();
  String best;
  int bestRssi = -999;
  String prefix = String(AP_SSID_BASE) + "-";
  for(int i = 0; i < n; ++i) {
    String s = WiFi.SSID(i);
    if((s.startsWith(prefix) || s == AP_SSID_BASE) && WiFi.RSSI(i) > bestRssi) {
      bestRssi = WiFi.RSSI(i);
      best = s;
    }
  }
  WiFi.scanDelete();
  return best;
}

static void connectToMain() {
  lastReconnectMs = millis();
  String ssid = pickTargetSsid();
  if(ssid.length() == 0) {
    linkUp = false;
    return;
  }
  joinedSsid = ssid;
  WiFi.begin(ssid, AP_PASS);

  uint32_t start = millis();
  while(WiFi.status() != WL_CONNECTED && millis() - start < 8000) {
    delay(100);
    yield();
  }
  linkUp = (WiFi.status() == WL_CONNECTED);
  if(linkUp && MDNS.begin(HOSTNAME)) MDNS.addService("http", "tcp", 80);
}

// -----------------------------------------------------------------------------
// Display
// -----------------------------------------------------------------------------
#ifndef REMOTE_HEADLESS
// One button row: "A inner  sample01  READY" / "B outer  (no sample)".
static void drawGateRow(int y, char label, const char* which, const String& sample, bool ready) {
  display.setFont(ArialMT_Plain_10);
  display.setTextAlignment(TEXT_ALIGN_LEFT);
  display.drawString(0, y, String(label) + " " + which);
  display.drawString(46, y, sample.length() ? sample : String("(no sample)"));
  display.setTextAlignment(TEXT_ALIGN_RIGHT);
  display.drawString(128, y, sample.length() ? (ready ? "READY" : "wait") : "");
}

static void drawStatus() {
  display.clear();
  display.setTextAlignment(TEXT_ALIGN_LEFT);

  const bool online = linkUp && mainView.valid &&
                      mainView.fetchedMs && (millis() - mainView.fetchedMs < 6000);

  if(!online) {
    display.setFont(ArialMT_Plain_24);
    display.setTextAlignment(TEXT_ALIGN_CENTER);
    display.drawString(64, 6, "OFFLINE");
    display.setFont(ArialMT_Plain_10);
    if(!linkUp) {
      display.drawString(64, 34, "out of range");
      display.drawString(64, 48, "scanning " + String(AP_SSID_BASE) + "-*");
    } else {
      display.drawString(64, 34, "no reply from node");
      display.drawString(64, 48, joinedSsid);
    }
    display.display();
    return;
  }

  // --- online ---------------------------------------------------------------
  // node state: idle / SENDING (playback) / BUSY (recording|sweeping)
  const char* state = "idle";
  if(mainView.mode == "playback")      state = "SENDING";
  else if(mainView.busy)               state = "BUSY";

  display.setFont(ArialMT_Plain_16);
  display.setTextAlignment(TEXT_ALIGN_LEFT);
  display.drawString(0, 0, "ONLINE");
  display.setTextAlignment(TEXT_ALIGN_RIGHT);
  display.drawString(128, 2, state);

  display.drawLine(0, 20, 128, 20);

  drawGateRow(24, 'A', "inner", mainView.innerSample, mainView.innerReady);
  drawGateRow(38, 'B', "outer", mainView.outerSample, mainView.outerReady);

  display.setFont(ArialMT_Plain_10);
  display.setTextAlignment(TEXT_ALIGN_LEFT);
  if(toast.length() && millis() < toastUntilMs) {
    display.drawString(0, 52, toast);
  } else {
    display.drawString(0, 52, "node " + (mainView.radio ? String("radio ok") : String("radio ?")));
    display.setTextAlignment(TEXT_ALIGN_RIGHT);
    display.drawString(128, 52, String(WiFi.RSSI()) + "dBm");
  }
  display.display();
}
#endif

static void showToast(const String& s) {
  setToast(s);
  Serial.println("[remote] " + s);
#ifndef REMOTE_HEADLESS
  drawStatus();
#endif
}

// -----------------------------------------------------------------------------
// Buttons
// -----------------------------------------------------------------------------
struct Button {
  uint8_t  pin;
  char     id;              // 'A' inner, 'B' outer
  const char* which;
  bool     stable = true;   // pull-up: released = HIGH = true
  bool     lastRead = true;
  uint32_t lastChangeMs = 0;
};
Button btnA{PIN_BTN_A, 'A', "inner"};
Button btnB{PIN_BTN_B, 'B', "outer"};

static void doFire(char id, const char* which) {
  ledButton(id);
  if(!linkUp) { showToast("no link to main"); return; }
  if(mainView.valid && mainView.busy) { showToast("main busy"); return; }

  showToast(String("firing ") + which + "...");
  bool ok = false;
  String resp = fireGateOnMain(which, &ok);

  if(ok) {
    showToast(String("sent ") + which + ": " + jsonStr(resp, "sampleName"));
  } else {
    String err = jsonStr(resp, "error");
    showToast(String("error: ") + (err.length() ? err : "fire failed"));
  }
  lastPollMs = 0;  // refresh view soon
}

static void serviceButton(Button& b) {
  bool r = digitalRead(b.pin);
  if(r != b.lastRead) {
    b.lastRead = r;
    b.lastChangeMs = millis();
  }
  if(millis() - b.lastChangeMs > BTN_DEBOUNCE_MS && r != b.stable) {
    b.stable = r;
    if(r == LOW) doFire(b.id, b.which);   // falling edge = press
  }
}

// -----------------------------------------------------------------------------
// Remote's own HTTP server (health / debug / test hook)
// -----------------------------------------------------------------------------
static void handleRemoteStatus() {
  const bool stale = (mainView.fetchedMs == 0) || (millis() - mainView.fetchedMs > 6000);
  String s = "{\"ok\":true,\"role\":\"remote\"";
  s += ",\"firmwareVersion\":\"" + String(FIRMWARE_VERSION) + "\"";
  s += ",\"uptimeMs\":" + String(millis() - bootMs);
  s += ",\"linkUp\":" + String(linkUp ? "true" : "false");
  s += ",\"joinedSsid\":\"" + joinedSsid + "\"";
  s += ",\"mainIp\":\"" + String(MAIN_IP) + "\"";
  s += ",\"apRssi\":" + String(linkUp ? WiFi.RSSI() : 0);
  s += ",\"mainReachable\":" + String((linkUp && mainView.valid && !stale) ? "true" : "false");
  s += ",\"lastPollAgeMs\":" + String(mainView.fetchedMs ? (millis() - mainView.fetchedMs) : -1);
  s += ",\"main\":{";
  s += "\"ok\":" + String(mainView.ok ? "true" : "false");
  s += ",\"radio\":" + String(mainView.radio ? "true" : "false");
  s += ",\"mode\":\"" + mainView.mode + "\"";
  s += ",\"busy\":" + String(mainView.busy ? "true" : "false");
  s += ",\"frequencyHz\":" + String(mainView.frequencyHz);
  s += ",\"heap\":" + String(mainView.heap);
  s += ",\"firmwareVersion\":\"" + mainView.fwVersion + "\"";
  s += ",\"gateEnabled\":" + String(mainView.gateEnabled ? "true" : "false");
  s += ",\"innerSample\":\"" + mainView.innerSample + "\"";
  s += ",\"outerSample\":\"" + mainView.outerSample + "\"";
  s += ",\"lastFireError\":\"" + mainView.lastFireError + "\"";
  s += "}}";
  server.send(200, "application/json", s);
}

static void handleRemotePress() {
  String which = server.arg("which");
  if(which != "inner" && which != "outer") {
    server.send(400, "application/json", "{\"ok\":false,\"error\":\"which must be inner or outer\"}");
    return;
  }
  ledButton(which == "inner" ? 'A' : 'B');
  if(!linkUp) {
    server.send(502, "application/json", "{\"ok\":false,\"error\":\"remote has no link to main\"}");
    return;
  }
  bool ok = false;
  String resp = fireGateOnMain(which.c_str(), &ok);
  setToast(String("press ") + which + (ok ? " ok" : " err"));
  lastPollMs = 0;
  String s = String("{\"ok\":") + (ok ? "true" : "false") + ",\"via\":\"remote\",\"which\":\"" + which + "\",\"main\":" + resp + "}";
  server.send(ok ? 200 : 502, "application/json", s);
}

