WingTangWong/Wireless_esp8266_cc110_tool/src/remote/remote_main.cpp
static void handleRoot() {
  String h = "<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>";
  h += "<title>cc1101 remote</title><body style='font-family:system-ui;max-width:32rem;margin:2rem auto'>";
  h += "<h2>cc1101 remote</h2><p>fw " + String(FIRMWARE_VERSION) + " &middot; link ";
  h += linkUp ? ("up (" + joinedSsid + ", " + String(WiFi.RSSI()) + " dBm)") : "down";
  h += "</p><p>main: " + mainView.mode + ", radio " + (mainView.radio ? "OK" : "?") + ", "
       + String(mainView.frequencyHz / 1e6, 3) + " MHz</p>";
  h += "<p><button onclick=\"fetch('/api/remote/press?which=inner',{method:'POST'})\">Inner</button> ";
  h += "<button onclick=\"fetch('/api/remote/press?which=outer',{method:'POST'})\">Outer</button></p>";
  h += "<p><a href='/api/remote/status'>/api/remote/status</a></p>";
  server.send(200, "text/html", h);
}

// -----------------------------------------------------------------------------
void setup() {
  bootMs = millis();
  Serial.begin(115200);
  Serial.println();
  Serial.printf("cc1101 remote %s  role=remote\n", FIRMWARE_VERSION);

  pinMode(PIN_LED, OUTPUT);
  analogWriteRange(1023);
  ledLevel(0);
  pinMode(PIN_BTN_A, INPUT_PULLUP);
  pinMode(PIN_BTN_B, INPUT_PULLUP);

#ifndef REMOTE_HEADLESS
  display.init();
  display.flipScreenVertically();
  display.setFont(ArialMT_Plain_10);
  display.drawString(0, 0, "cc1101 remote");
  display.drawString(0, 14, FIRMWARE_VERSION);
  display.drawString(0, 34, "pairing...");
  display.display();
#endif

  WiFi.persistent(false);
  WiFi.mode(WIFI_STA);
  WiFi.hostname(HOSTNAME);
  WiFi.setAutoReconnect(true);
  connectToMain();

  server.on("/", HTTP_GET, handleRoot);
  server.on("/api/remote/status", HTTP_GET, handleRemoteStatus);
  server.on("/api/remote/press", HTTP_POST, handleRemotePress);
  server.begin();
}

void loop() {
  server.handleClient();
  if(linkUp) MDNS.update();

  serviceButton(btnA);
  serviceButton(btnB);

  const uint32_t now = millis();

  if(WiFi.status() != WL_CONNECTED) {
    linkUp = false;
    if(now - lastReconnectMs > RECONNECT_EVERY_MS) connectToMain();
  } else {
    linkUp = true;
  }

  if(linkUp && now - lastPollMs > POLL_INTERVAL_MS) {
    lastPollMs = now;
    refreshMainView();
  }

#ifdef REMOTE_SELFTEST
  static uint32_t lastSelftestMs = 0;
  static bool selftestPrimed = false;
  if(linkUp && mainView.valid && (!selftestPrimed || now - lastSelftestMs > 45000)) {
    selftestPrimed = true;
    lastSelftestMs = now;
    stSnapshot();
    stRun();
    lastPollMs = 0;   // refresh the cached view after
  }
#endif

#ifndef REMOTE_HEADLESS
  static uint32_t lastDraw = 0;
  if(now - lastDraw > 250) { lastDraw = now; drawStatus(); }
#endif

  static uint32_t lastLog = 0;
  if(now - lastLog > 5000) {
    lastLog = now;
    Serial.printf("[remote] link=%d ssid=%s main.valid=%d reachable=%d mode=%s radio=%d rssi=%d\n",
                  linkUp, joinedSsid.c_str(), mainView.valid,
                  (mainView.fetchedMs && now - mainView.fetchedMs < 6000), mainView.mode.c_str(),
                  mainView.radio, linkUp ? WiFi.RSSI() : 0);
  }

  updateLed(linkUp && mainView.valid && mainView.fetchedMs &&
            (now - mainView.fetchedMs < 6000));

  yield();
}
